[
  {
    "title": "StressBall",
    "description": "Award-winning AI voice agent that autonomously places phone calls, navigates phone trees, and summarizes conversations.",
    "longDescription": "Built an AI-powered voice agent that autonomously calls real businesses, navigates complex phone trees, and delivers structured conversation summaries. Engineered a scalable, serverless backend using Cloudflare Workers and Model Context Protocol, with LiveKit Cloud handling real-time voice streaming and Telnyx enabling automated outbound calls. Designed an iMessage-based interface using the Poke API, allowing users to text requests and receive AI-generated transcripts stored persistently in Cloudflare KV.",
    "stack": ["Cloudflare", "LiveKit Cloud", "Telnyx", "Model Context Protocol", "Poke", "JavaScript"],
    "link": "https://devpost.com/software/stressball",
    "image": "StressBall.png"
  },
  {
    "title": "RCC Site",
    "description": "Modern web platform built to support Responsible Computing Club outreach, content, and member engagement.",
    "longDescription": "Developed a responsive website to centralize Responsible Computing Club resources, events, and announcements. Implemented reusable React components and optimized page performance using Next.js for fast navigation and SEO-friendly rendering. Collaborated closely with club leadership to ensure the site effectively communicated the organization’s mission while remaining easy to update and maintain.",
    "stack": ["React", "Next.js", "Node.js"],
    "link": "https://www.rccsjsu.com/",
    "image": "RCC-Site.png"
  },
  {
    "title": "SCE Venmo Automation",
    "description": "Automated payment verification system to streamline club membership dues through Venmo.",
    "longDescription": "Designed and implemented a secure RESTful API to automate verification of Venmo payments for Software and Computer Engineering club members. Built backend logic to track payment status, associate transactions with members, and reduce manual administrative overhead. Ensured reliability and scalability by structuring clean API endpoints and persistent data storage for auditability.",
    "stack": ["Node.js", "Express", "MongoDB"],
    "link": "https://github.com/SCE-Development/Clark/pull/1993",
    "image": "SCE-Site.png"
  },
  {
    "title": "Card Classifier",
    "description": "Deep learning model that classifies playing cards across 53 distinct categories.",
    "longDescription": "Built and trained an image classification neural network using PyTorch to recognize playing cards across 53 classes. Implemented custom training and evaluation loops utilizing stochastic gradient descent and cross-entropy loss. Analyzed model performance by visualizing training and validation metrics with Matplotlib to detect overfitting and guide hyperparameter tuning.",
    "stack": ["PyTorch", "Matplotlib", "NumPy", "Python", "Jupyter"],
    "link": "https://colab.research.google.com/drive/1GpDsvrsnziWMgegEAMlD03YH9X1UfVea?usp=sharing",
    "image": "CardClassifier.png"
  },
  {
    "title": "Mancala Game",
    "description": "Object-oriented Mancala game application designed with scalable architecture patterns.",
    "longDescription": "Developed a fully functional Mancala game using Java with a clean MVC architecture separating game logic from UI. Applied the Strategy Design Pattern to support multiple board layouts and rule variations, improving extensibility and maintainability. Integrated observer-based updates to efficiently synchronize game state changes with the user interface.",
    "stack": ["Java", "Java Swing", "AWT", "Eclipse", "Git/GitHub"],
    "link": "https://github.com/CodeOperated/CS151TeamProject",
    "image": "Mancala.png"
  },
  {
    "title": "AutoMail",
    "description": "AI-powered Chrome extension that generates personalized, context-aware email replies.",
    "longDescription": "Built a Chrome extension that automatically drafts intelligent email responses using the Gemini API. Implemented DOM parsing and web scraping to extract real-time email content directly from Gmail’s interface. Integrated Gmail and Google People APIs to authenticate users, retrieve messages, and personalize responses based on sender context and contact data.",
    "stack": ["React", "Node.js", "Next.js", "Google Gemini API", "Gmail API"],
    "link": "https://devpost.com/software/automail-19zl2v",
    "image": "Gmail.avif"
  }
]
